# Core
brew "chezmoi"
brew "coreutils"
brew "git"
brew "git-lfs"
# brew "mas"  # Requires swift source build on macOS 13 Intel
brew "wget"

# Shell
brew "fzf"
brew "tmux"
brew "zplug"

# Editor
brew "neovim"

# Search & file tools
brew "bat"
# brew "eza"  # Install via cargo on macOS 13 Intel (no bottle available)
brew "fd"
brew "jq"
brew "ripgrep"
brew "tree"
# brew "yq"  # Requires pandoc/cabal source build on macOS 13 Intel

# Git tools
brew "gh"
brew "ghq"
brew "gitleaks"
brew "lazygit"

# Development
brew "cmake"
brew "direnv"
# brew "mise"  # Install via curl (https://mise.run) on macOS 13 Intel (no bottle available)
brew "mycli"
# brew "mysql-client"  # Requires LLVM source build on macOS 13 Intel
brew "pgcli"
brew "shellcheck"

# Cloud
brew "awscli"

# Build tools
brew "ffmpeg"

# GUI apps
# cask "docker"  # Requires macOS Sonoma or later
# cask "google-chrome"  # Requires sudo for pkg installer; install manually
# cask "google-japanese-ime"  # Requires sudo for pkg installer; install manually
# cask "karabiner-elements"  # Requires sudo for pkg installer; install manually
cask "spotify"
cask "visual-studio-code"
# cask "zoom"  # Requires sudo for pkg installer; install manually

# Mac App Store
# mas "LINE", id: 539883307  # Requires mas (unavailable on macOS 13 Intel)
# mas "Xcode", id: 497799835  # Large download (~7GB); install manually if needed
